import sys
import re

ctiDict = {
    ':\\': 'ˑ', ':': 'ː', '"': 'ˈ', "'": 'ˈ', '%': 'ˌ', ',': 'ˌ', '.': '.', 
    'tS)': 't͡ʃ', 'dZ)': 'd͡ʒ', 'ts)': 't͡s', 'dz)': 'd͡z', 
    'tK)': 't͡ɬ', 'kp)': 'k͡p', 'gb)': 'g͡b', 'Nm)': 'ŋ͡m',
    'ts\\)': 't͡ɕ', 'dz\\)': 'd͡ʑ',
    'tS': 'tʃ', 'dZ': 'dʒ', 'ts': 'ts', 'dz': 'dz',
    'p\\': 'ɸ', 'B\\': 'ʙ', 'B_o': 'β̞', 'G\\': 'ɢ', 'h\\': 'ɦ', 'H\\': 'ʜ',
    'j\\': 'ʝ', 'J\\': 'ɟ', 'K\\': 'ɮ', 'l\\': 'ɺ', 'L\\': 'ʟ', 
    'M\\': 'ɰ', 'N\\': 'ɴ', 'r\\': 'ɹ', 'R\\': 'ʀ', 's\\': 'ɕ', 'z\\': 'ʑ',
    'v\\': 'ʋ', 'x\\': 'ɧ', '?\\': 'ʕ', '<\\': 'ʢ', '>\\': 'ʡ', 
    '!\\': 'ǃ', '|\\|\\': 'ǁ', '|\\': 'ǀ', '=\\': 'ǂ',
    's`': 'ʂ', 'z`': 'ʐ', 't`': 'ʈ', 'd`': 'ɖ', 'n`': 'ɳ', 'l`': 'ɭ', 
    'r`': 'ɽ', 'K`': 'ɬ̢', 'r`r)': 'ɽ͡r', 'r\\`': 'ɻ', 'l\\`': 'ɺ̢',
    'b_<': 'ɓ', 'd_<': 'ɗ', 'J\\_<': 'ʄ', 'g_<': 'ɠ', 'G\\_<': 'ʛ',
    'p_>': 'pʼ', 't_>': 'tʼ', 'k_>': 'kʼ', 's_>': 'sʼ',
    '_h': 'ʰ', '_w': 'ʷ', '_j': 'ʲ', ';': 'ʲ', '`': '˞', '~': '̃', 
    '_0': '̥', '_v': '̬', '=': '̩', '_"': '̈', '_+': '̟', '_-': '̠',
    '_A': '̘', '_q': '̙', '_o': '̞', '_r': '̝', '_O': '̹', '_c': '̜',
    '?': 'ʔ', 'T': 'θ', 'D': 'ð', 'S': 'ʃ', 'Z': 'ʒ', 'N': 'ŋ', 
    'J': 'ɲ', 'L': 'ʎ', 'R': 'ʁ', 'G': 'ɣ', 'C': 'ç', 'H': 'ɥ',
    'B': 'β', 'K': 'ɬ', 'P': 'ʋ', 'Q': 'ɒ', 'W': 'ʍ', 'X': 'χ',
    'i\\': 'ɨ', 'u\\': 'ʉ', 'I\\': 'ɪ̈', 'U\\': 'ʊ̈', '@\\': 'ɘ', 
    '3\\': 'ɞ', '&\\': 'ɶ',
    '&': 'æ', '1': 'ɨ', '}': 'ʉ', '2': 'ø', '3': 'ɜ', '6': 'ɐ', 
    '7': 'ɤ', '8': 'ɵ', '9': 'œ', '@': 'ə', 'V': 'ʌ', 'I': 'ɪ', 
    'E': 'ɛ', 'O': 'ɔ', 'U': 'ʊ', 'Y': 'ʏ', 'M': 'ɯ', 'A': 'ɑ', 
    'a': 'a', 'e': 'e', 'i': 'i', 'o': 'o', 'u': 'u', 'y': 'y'
}

def conCti(a_idx):
    a_ks = sorted(ctiDict.keys(), key = len, reverse = True)
    a_escKeys = [re.escape(k) for k in a_ks]
    a_kPtr = re.compile('|'.join(a_escKeys))
    return a_kPtr.sub(lambda match: ctiDict[match.group(0)], a_idx)

if len(sys.argv) < 2:
    print("Provide CXS text. Usage: python cti.py \"cxs text\"")
    sys.exit()

cxsIdx = ' '.join(sys.argv[1:])
ipaOut = conCti(cxsIdx)

print(ipaOut)

with open("ipa_out.txt", "w", encoding="utf-8") as file:
    file.write(ipaOut)
    